gh-pages/docker/Running-GUI-Application.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Docker에서 GUI 어플리케이션 실행하기</title>
<!-- 2018-09-18 Tue 07:03 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Dongsoo Lee" />
</head>
<body>
<div id="content">
<h1 class="title">Docker에서 GUI 어플리케이션 실행하기</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Mac OS</a>
<ul>
<li><a href="#sec-1-1">1.1. 설치 방법</a></li>
<li><a href="#sec-1-2">1.2. 실행 방법</a></li>
<li><a href="#sec-1-3">1.3. 사용 예</a></li>
<li><a href="#sec-1-4">1.4. 오류 확인</a></li>
<li><a href="#sec-1-5">1.5. XQuarz 제거 방법(요세미티/엘 캐피탄/시에라)</a></li>
</ul>
</li>
<li><a href="#sec-2">2. 참조</a></li>
</ul>
</div>
</div>
<p>
이 문서는 Docker 컨테이너 실행 시 <code>DISPLAY</code> 옵션에 대해서 다룹니다.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Mac OS</h2>
<div class="outline-text-2" id="text-1">
<p>
GUI를 연결하기 위해서 <a href="https://www.xquartz.org/releases/XQuartz-2.7.10.html">Xquartz</a>의 X11 서버 및 클라이언트 라이브러가 필요합니다.
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 설치 방법</h3>
<div class="outline-text-3" id="text-1-1">
<ol class="org-ol">
<li><a href="https://dl.bintray.com/xquartz/downloads/XQuartz-2.7.10.dmg">XQuartz-2.7.10.dmg</a> 다운로드(현재 버전인 2.7.11 은 맥용 Docker에서 작동하지 않습니다.)
</li>
<li>XQuartz 설치(관리자 권한 필요)
</li>
<li>설치 후 시스템 로그아웃 혹은 재부팅
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 실행 방법</h3>
<div class="outline-text-3" id="text-1-2">
<ol class="org-ol">
<li><code>open -a XQuartz</code> : XQuartz 실행
</li>
<li>실행 후 환경 설정(~⌘ ,~)에서 "보안 &gt; 네트워크 클라이언트에서의 연결을 허용" 체크
</li>
<li><code>DISPLAY_IP=`ifconfig en0 | grep "inet " | cut -d " " -f2`</code>
</li>
<li><code>xhost + $DISPLAY_IP</code>
<ul class="org-ul">
<li>"&lt;IP 주소&gt; being added to access control list" 의 메시지가 나오면 정상적으로 IP가 추가 된 것입니다.
</li>
</ul>
</li>
<li><code>docker run --rm -it --name emacs -e DISPLAY=$DISPLAY_ID:0 jess/geary</code>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> 사용 예</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li><a href="../emacs/Running-with-Docker.html">Emacs를 Docker로 실행하기</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> 오류 확인</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li><code>lsof -i :6000</code>
</li>
</ul>
<p>
현재 <code>X11.bin</code> 명령이 TCP 6000 포트로 열려있는지 확인하세요.
</p>
</div>
</div>

<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> XQuarz 제거 방법(요세미티/엘 캐피탄/시에라)</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li><a href="https://gist.github.com/pwnsdx/d127873e24cef159d4d603accaf37ee4">Gist 참조</a>
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 참조</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><a href="https://github.com/chanezon/docker-tips/blob/master/x11/README.md">Running Graphical applications in Docker for Mac</a>
</li>
<li><a href="https://www.xquartz.org/">XQaurtz</a>
</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2018-04-19</p>
<p class="author">Author: Dongsoo Lee</p>
<p class="date">Created: 2018-09-18 Tue 07:03</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
